Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: One-- because it's important, but also it explains a lot about how the hemoglobin-- or the red blood cells, depending on what level you want to operate-- know, and I have to use know in quotes.
ht: UN - paske li enpòtan, men tou li eksplike anpil osijè de kòman moglobin a - ou wouj la san cellules, en sou nivo sa ou vle pou opere - konnen mwen gen pou utiliser konnen nan site.

source: These aren't sentient beings, but how do they know when to pick up the oxygen and when to drop off the oxygen?
ht: Sa pa plis bèt, men ki jan fè yo konnen ki lè pou ranmase oksijèn an ak lè pou li depoze oksijèn an?

source: So this right here, this is actually a picture of a hemoglobin protein.
ht: Se konsa sa a droit isit la, se aktyèlman yon foto yon moglobin protéines. Pou l' fè kat sid amine chenn.

source: That's one of them.
ht: Sa se youn nan yo.

source: Those are the other two.
ht: Moun yo tou de.

source: We're not going to go into the detail of that, but these look like little curly ribbons.
ht: Nou pa pral antre nan tout ti detay nan sa, men, gade sa yo tankou ti rubans accolades.

source: If you imagine them, they're a bunch of molecules and amino acids and then they're curled around like that.
ht: Si ou kwè yo, yo gen yon pakèt de molécules Et aminés acides Et lè sa a yo ap boudinées nan kon sa.

source: So this on some level describes its shape.
ht: Se poutèt sa a sou nivo kèk dekri fòm li.

source: And in each of those groups or in each of those chains, you have a heme group here in green.
ht: Et nan chak gwoup sa yo ou nan chak nan chenn sa yo, ou gen yon heme gwoup isit la nan vèt.

source: That's where you get the hem in hemoglobin from.
ht: Sa se kote ou rive fè woulèt a nan moglobin de.

source: You have four heme groups and the globins are essentially describing the rest of it-- the protein structures, the four peptide chains
ht: Ou gen kat gwoup heme Et les globins sont esansyèlman décrivant tout rès l--ke protéines, la kat ti chenn peptide

source: Now, this heme group-- this is pretty interesting.
ht: Koulye a, sa a heme gwoup - sa trè enteresan.

source: It actually is a porphyrin structure.
ht: Li aktyèlman se yon estrikti porphyrin.

source: And if you watch the video on chlorophyil, you'd remember a porphyrin structure, but at the very center of it, in chlorophyil, we had a magnesium ion, but at the very center of hemoglobin, we have an iron ion and this is where the oxygen binds.
ht: Si ou gade videyo sou chlorophyll, ou ta ka sonje yo ak yon estrikti porphyrin, men, nan mitan très sa, nan chlorophyll, nou te genyen yon ion magnésium, men lè a trè sant de moglobin, nou gen yon fèt an fè ion Et sa se kote oksijèn an se.

source: So on this hemoglobin, you have four major binding sites for oxygen.
ht: Pour la moglobin sa a, nou menm, kote kat gwo Liaison pou oksijèn.

source: You have right there, maybe right there, a little bit behind, right there, and right there.
ht: Ou gen la a, gen dwa la a, yon ti jan dèyè, il dwat, Et il dwat.

source: Now why is hemoglobin-- oxygen will bind very well here, but hemoglobin has a several properties that one, make it really good at binding oxygen and then also really good at dumping oxygen when it needs to dump oxygen.
ht: Koulye a, moglobin - oksijèn sa k ap mare trè byen isit la, men moglobin gen yon anpil nan pwopwiyete sa yonn, pase vrèman bon nan Liaison oksijèn, lè sa a tou vrèman bon nan depotwa oksijèn lè li bezwen pou image oksijèn.

source: So it exhibits something called cooperative binding.
ht: Se konsa li expositions yon bagay yo rele Liaison kowopere.

source: And this is just the principle that once it binds to one oxygen molecule-- let's say one oxygen molecule binds right there-- it changes the shape in such a way that the other sites are more likely to bind oxygen.
ht: Sa se sèlman pwensip sa yon fwa li se yon oksijèn Molekil - an nou yonn ap di se Molekil oksijèn droit gen - l' chanje fòm nan yon jan sa a lòt bò yo gen plis chans pou mare oksijèn.

source: So it just makes it-- one binding makes the other bindings more likely.
ht: Se konsa li jis pou fè li-Ann yon sèl vant fè lòt la liaisons plis chans. Koulye a, nou di: dakò, sa byen.

source: That makes it a very good oxygen acceptor, when it's traveling through the pulmonary capillaries and oxygen is diffusing from the alveoli.
ht: Sa fè l' yon bon anpil oksijèn Entrepreneur, lè l' gen ale kare kapilè Et oksijèn diffusion de alveoli.

source: That makes it really good at picking up the oxygen, but how does it know when to dump the oxygen?
ht: Sa fè li vrèman bon nan kase pye oksijèn an, men ki jan èske li konnen ki lè pou image oksijèn an?

source: This is an interesting question.
ht: Sa se yon kesyon enteresan.

source: It doesn't have eyes or some type of GPS system that says, this guy's running right now and so he's generating a lot of carbon dioxide right now in these capillaries and he needs a lot of oxygen in these capillaries surrounding his quadriceps.
ht: Li pa gen je ou de KÒDONE sistèm nan ki te voye di ou: nèg sa a la kouri kounye a e se konsa li génération anpil de kabòn kounye a nan kapilè sa yo ak bezwen li yon bann oksijèn nan sa yo kapilè entourant l quadriceps.

source: I need to deliver oxygen.
ht: Mwen bezwen pou delivwe oksijèn.

source: It doesn't know it's in the quadraceps.
ht: Li pa konnen se nan quadraceps la.

source: How does the hemoglobin know to let go of the oxygen there?
ht: Ki jan fè moglobin a konnen pou yo, y' ap kite peyi a oksijèn?

source: And that's a byproduct of what we call allosteric inhibition, which is a very fancy word, but the concept's actually pretty straightforward.
ht: E se pou sa yon "de sa nou rele anpèchman allosteric, sa se yon pawòl trè fantaisie, men ke a aktyèlman très simple.

source: When you talk about allosteric anything-- it's often using the context of enzymes-- you're talking about the idea that things bind to other parts.
ht: Lè ou pale osijè allosteric yon bagay ki li souvan itilize yon kontèks enzymes-ou ap di osijè de lide sa bagay lier lòt kote.

source: Allo means other.
ht: Allo vle di lòt.

source: So you're binding to other parts of the protein or the enzyme-- and enzymes are just proteins-- and it affects the ability of the protein or the enzyme to do what it normally does.
ht: Se konsa, ou ap Liaison lòt kote, de protéines a ou a nzim - Et enzymes sont sèlman protéines - Et l' Sur la abilite de protéines a ou nzim a pou fè Kisa sa te konn fèt.

source: So hemoglobin is allosterically inhibited by carbon dioxide and by protons.
ht: Se konsa moglobin allosterically jennen pa kabòn Et pa protons.

source: So carbon dioxide can bond to other parts of the hemoglobin-- I don't know the exact spots-- and so can protons.
ht: Se konsa kabòn kapab bond lòt kote, de la moglobin - mwen pa konnen egzat a tach - Et sa kapab protons.

source: So remember, acidity just means a high concentration of protons.
ht: Se konsa sonje, dlo si sou lestonmak jis vle di yon wo konsantrasyon de protons.

source: So if you're in an acidic environment, protons can bond.
ht: Se konsa si ou gen nan yon dlo si anviwònman an, protons ka bond.

source: Maybe I'll do the protons in this pink color.
ht: Gen dwa m a fe pa protons nan koulè penk sa a.

source: Protons-- which are just hydrogen without electrons, right-- protons can bond to certain parts of our protein and it makes it harder for them to hold onto the oxygen.
ht: Protons - ki se jis kèk Idwojèn san électrons, protons regleman ki kapab bond konnen se pati de protéines nou Apre sa, li fè l' di pou yo pou yo kapab kenbe oksijèn an.

source: So when you're in the presence of a lot of carbon dioxide or an acidic environment, this thing is going to let go of its oxygen.
ht: Se konsa, lè w ap e anpil kabòn ou è yon anviwonman, bagay sa a va pou yo, y' ap kite de oksijèn li.

source: And it just happens to be that that's a really good time to let go of your oxygen.
ht: Et li jis rive pou sa se vrèman bon moman pou y' ap kite de oksijèn ou.

source: Let's go back to this guy running.
ht: An n ale dèyè nèg sa a kouri.

source: There's a lot of activity in these cells right here in his quadriceps.
ht: Pa gen anpil aktivite nan sa yo cellules isit-menm lè yo quadriceps.

source: They're releasing a lot of carbon dioxide into the capillaries.
ht: Yo gen yon bann kabòn nan nan piblikasyon an kapilè.

source: At that point, they're going from arteries into veins and they need a lot of oxygen, which is a great time for the hemoglobin to dump their oxygen.
ht: Nan ki pwen, yo pral de artères nan varis Et yo bezwen anpil oksijèn, ki se yon gwo pou a moglobin pou image oksijèn yo.

source: So it's really good that hemoglobin is allosterically inhibited by carbon dioxide.
ht: Se poutèt sa vrèman bon ke moglobin se allosterically jennen pa kabòn.

source: Carbon dioxide joins on certain parts of it.
ht: Kabòn se sou kèk pati nan li.

source: It starts letting go of its oxygen, that's exactly where in the body the oxygen is needed.
ht: Li commence laisser aller de oksijèn li, sa se exactement kote gen bezwen nan kò sa a oksijèn an pou.

source: Now you're saying, wait.
ht: Koulye a, ou di, tann.

source: What about this acidic environment?
ht: E osijè de anviwònman ote/dlo sa a?

source: How does this come into play?
ht: Ki jan ou fè bagay sa yo rive nan jwèt?

source: Well, it turns out that most of the carbon dioxide is actually disassociated.
ht: Men, li active soti pi fò sa de kabòn a se Association aktyèlman.

source: It actually disassociates.
ht: Li aktyèlman disassociates.

source: It does go into the plasma, but it actually gets turned into carbonic acid.
ht: Li antre nan a ikid ki nan san, men li aktyèlman te vin tounen nan sid carbonique.

source: So I'll just write a little formula right here.
ht: Se poutèt sa, m' ap ekri jis yon ti fòmil droit isit la.

source: So if you have some CO2 and you mix it with the water-- I mean, most of our blood, the plasma-- it's water.
ht: Si ou gen kèk CO2 Et ou v mele l' ak dlo a - m vle di, pifò nan san nou, ikid ki nan san - li la bò dlo.

source: So you take some carbon dioxide, you mix it with water, and you have it in the presence of an enzyme-- and this enzyme exists in red blood cells.
ht: Pou ou pote kèk kabòn, ou melanje l' ak dlo, ak ou jwenn li e yon nzim - Et nzim sa a yon pwofon nan globil wouj nan san.

source: It's called carbonic anhydrase.
ht: Li rele anhydrase;. Vin nan tèt yon reaksyon kont a yon - esansyèlman ou ap fini avèk asid.

source: We have H2CO3.
ht: Nou gen H2CO3. Li tout ekilibre.

source: We have three oxygens, two hydrogens, one carbon.
ht: Nou genyen twa oxygens, de hydrogens, yon sèl kabòn.

source: It's called carbonic acid because it gives away hydrogen protons very easily.
ht: Li rele sid; paske li bay wout Idwojèn protons trè fasil.

source: Acids disassociate into their conjugate base and hydrogen protons very easily.
ht: Acides dissocier nan baz conjugué yo ak Idwojèn protons trè fasil.

source: So carbonic acid disassociates very easily.
ht: Se konsa; sid disassociates trè fasil.

source: It's an acid, although I'll write in some type of an equilibrium right there.
ht: Li se yon sid, malgre sa, m' ap ekri an de yon équilibre la a.

source: If any of this notation really confuses you or you want more detail on it, watch some of the chemistry videos on acid disassociation and equilibrium reactions and all of that, but it essentially can give away one of these hydrogens, but just the proton and it keeps the electron of that hydrogen so you're left with a hydrogen proton plus-- well, you gave away one of the hydrogens so you just have one hydrogen.
ht: Si yonn nan notasyon sa vrèman confond ou ou ou vle plis détail sou li, gade ti gout nan videyo Chimi sou nan sid se Et réactions équilibre Et tout moun sa, men, li esansyèlman ka bay kò yonn nan hydrogens sa yo, men, jis la proton Et li kenbe microscope de sa Idwojèn Se konsa ou te ap kite ak yon Idwojèn proton plis - byen, ou te bay

source: This is actually a bicarbonate ion.
ht: Sa se aktyèlman yon bikabonak ion.

source: But it only gave away the proton, kept the electron so you have a minus sign.
ht: Men, li sèlman te ale a proton, kenbe microscope a sa ou gen yon siy mwens.

source: So all of the charge adds up to neutral and that's neutral over there.
ht: Se konsa tout akizasyon an ajoute pou neutres e pou sa netral laba a.

source: So if I'm in a capillary of the leg-- let me see if I can draw this.
ht: Se konsa si m' se nan yon ti venn nan janm - fè m' wè Si mwen ka fè sa.

source: So let's say I'm in the capillary of my leg.
ht: Se konsa nou di mwen ye nan ti venn de pye m.

source: Let me do a neutral color.
ht: Se pou m' fè yon koulè netral.

source: So this is a capillary of my leg.
ht: Se poutèt sa se yon ti venn de pye m.

source: I've zoomed in just one part of the capillary.
ht: Mwen te gen zoomed nan yon sèl pati nan ti venn a.

source: It's always branching off.
ht: Li plen toujou.

source: And over here, I have a bunch of muscle cells right here that are generating a lot of carbon dioxide and they need oxygen.
ht: E pase isit la, mwen gen yon pakèt moun nan pye cellules isit-menm sa génération anpil kabòn epi yo bezwen oksijèn.

source: Well, what's going to happen?
ht: Men, sa ki pwal pase?

source: Well, I have my red blood cells flowing along.
ht: Men, mwen fè m' selil wouj nan ap koule tankou dlo.

source: It's actually interesting-- red blood cells-- their diameter's 25% larger than the smallest capillaries.
ht: Li aktyèlman enteresan - globil wouj nan san - yo 25% pi gwo tou pase kapilè pi piti dyamèt a.

source: So essentially they get squeezed as they go through the small capillaries, which a lot of people believe helps them release their contents and maybe some of the oxygen that they have in them.
ht: Se konsa esansyèlman yo jwenn pressé menm jan yo pase nan mitan kapilè ti, ki kwè ke anpil moun te ede yo libere yo sa ki nan liv ak petèt kèk oksijèn an yo gen nan yo.

source: So you have a red blood cell that's coming in here.
ht: Se konsa, ou gen yon selil san nan wouj ki gen pou vini an isit la.

source: It's being squeezed through this capillary right here.
ht: Li te pressé nan ti venn sa a isit.

source: It has a bunch of hemoglobin-- and when I say a bunch, you might as well know right now, each red blood cell has 270 million hemoglobin proteins.
ht: Li gen yon pakèt de moglobin - Et lè m' ap di: Ann, ou ka tou konnen kounye a, globil wouj chak genyen 270 milyon moglobin protéines.

source: And if you total up the hemoglobin in the entire body, it's huge because we have 20 to 30 trillion red blood cells.
ht: Et si ou total pou moute moglobin nan tout kò sa a sa yon gwo paske nou gen 20 a 30 milliards selil wouj.

source: And each of those 20 to 30 trillion red blood cells have 270 million hemoglobin proteins in them.
ht: Men yo chak nan sa 20 pou 30 milliards selil wouj 270 milyon moglobin protéines nan yo.

source: So we have a lot of hemoglobin.
ht: Se konsa nou gen anpil moglobin.

source: So anyway, that was a little bit of a-- so actually, red blood cells make up roughly 25% of all of the cells in our body.
ht: Se konsa tout, ki te genyen yon ti yon - aktyèlman, wouj selil bat la leve anvan environ 25% de tout de la cellules nan kò nou.

source: We have about 100 trillion or a little bit more, give or take.
ht: Nou gen sou 100 000 ou yon ti bit bay plis, ou pran.

source: I've never sat down and counted them.
ht: Mwen te gen janm te chita Et fin konte yo.

source: But anyway, we have 270 million hemoglobin particles or proteins in each red blood cell-- explains why the red blood cells had to shed their nucleuses to make space for all those hemoglobins.
ht: Men, de tout fason, nou genyen 270 milyon moglobin matyè ou protéines nan chak globil wouj ki eksplike poutèt wouj la selil te gen pou li nucleuses yo pou fè plas tout hemoglobins sa yo.

source: They're carrying oxygen.
ht: Y' ap pote oksijèn.

source: So right here we're dealing with-- this is an artery, right?
ht: Gen pou regle isit la nou gen rapò avèk - sa se yon gwo venn, dwat?

source: It's coming from the heart.
ht: L ap vini nan kè moun.

source: The red blood cell is going in that direction and then it's going to shed its oxygen and then it's going to become a vein.
ht: Globil wouj nan direksyon sa. Lè sa a li a pwal va pou li oksijèn li. Lè sa a li a pwal devni yon venn nan janm.

source: Now what's going to happen is you have this carbon dioxide.
ht: Koulye a sa ki pwal pase, se ou gen kabòn sa a.

source: You have a high concentration of carbon dioxide in the muscle cell.
ht: Ou gen yon konsantrasyon kabòn nan anwo nan syèl la a selil nan pye.

source: It eventually, just by diffusion gradient, ends up-- let me do that same color-- ends up in the blood plasma just like that and some of it can make its way across the membrane into the actual red blood cell.
ht: Li evantyèlman, jis ke piblikasyon dégradé, fini leve- kite m' fè sa menm koulè - fini nan a lasma sangen annik konsa ak ti gout nan li ka fè pase dans la

source: In the red blood cell, you have this carbonic anhydrase which makes the carbon dioxide disassociate into-- or essentially become carbonic acid, which then can release protons.
ht: Nan selil san wouj la, ou gen sa a anhydrase ki fè a kabòn dissocier nan - ou esansyèlman devenir; sid, ki Lè sa a ka remèt protons.

source: Well, those protons, we just learned, can allosterically inhibit the uptake of oxygen by hemoglobin.
ht: Men, moun protons yo, nou te jis prete, kapab allosterically empêcher absorption de oksijèn pa moglobin.

source: So those protons start bonding to different parts and even the carbon dioxide that hasn't been reacted with-- that can also allosterically inhibit the hemoglobin.
ht: Se konsa moun protons kòmanse Liaison diferan pati ak menm kabòn sa pa t a ak ­ ki kapab tou allosterically empêcher moglobin a.

source: So it also bonds to other parts.
ht: Se konsa li tou obligations lòt kote.

source: And that changes the shape of the hemoglobin protein just enough that it can't hold onto its oxygens that well and it starts letting go.
ht: Et sa chanje fòm de protéines moglobin a sèlman ase pou l' pa ka kenbe sou oxygens li sa ki byen ak sa commence laisser aller.

source: And just as we said we had cooperative binding, the more oxygens you have on, the better it is at accepting more-- the opposite happens.
ht: E menm jan nou te di nou pa gen kowopere Liaison, plis ou gen sou oxygens, le mieux se nan accepter plis ­ a vi-za vi pwodwi.

source: When you start letting go of oxygen, it becomes harder to retain the other ones.
ht: Lè ou konmanse laisser aller de oksijèn, li vin pi fò pou conserver lòt 24.

source: So then all of the oxygens let go.
ht: Se konsa lè sa a tout de oxygens yo y' ap kite.

source: So this, at least in my mind, it's a brilliant, brilliant mechanism because the oxygen gets let go just where it needs to let go.
ht: Se poutèt sa, pou pi piti nan kè m, se brillante yon, briyan mécanisme paske oksijèn an gen pou ale sèlman kote li bezwen pou yo, y' ap kite.

source: It doesn't just say, I've left an artery and
ht: Li pa jis di: mwen te kite yon gwo venn Et

source: I'm now in a vein.
ht: Mwen se koulye a nan yon venn nan janm.

source: Maybe I've gone through some capillaries right here and I'm going to go back to a vein.
ht: Petèt mwen te pase nan kèk kapilè isit-menm ak mwen menm pwal pou-m tounen yon venn nan janm.

source: Let me release my oxygen-- because then it would just release the oxygen willy-nilly throughout the body.
ht: Se pou m' lage m' oksijèn-, paske lè sa li ta ka sèlman version oksijèn au tout kò a.

source: This system, by being allosterically inhibited by carbon dioxide and an acidic environment, it allows it to release it where it is most needed, where there's the most carbon dioxide, where respiration is occurring most vigorously.
ht: Sistèm sa a, pa te allosterically jennen pa kabòn Et yon anviwonman è, sa ki pèmèt li pou version l' kote l' ki pi bezwen, kote ki pa gen plis kabòn, kote bouch nan bouch se ki pi tout kouray.

source: So it's a fascinating, fascinating scheme.
ht: Se poutèt sa yon fascinante, fascinante régime.

source: And just to get a better understanding of it, right here I have this little chart right here that shows the oxygen uptake by hemoglobin or how saturated it can be.
ht: Et tout pou jwenn yon pi bon konesans sa, dwat mwen gen sa a ti graphique isit-menm ki montre isit la a oksijèn absorption pa moglobin ou jan saturée li kapab.

source: And you might see this in maybe your biology class so it's a good thing to understand.
ht: Et, ou te ka wè sa nan petèt ou klas Biyoloji se konsa li se yon bon bagay pou w konprann.

source: So right here, we have on the x-axis or the horizontal axis, we have the partial pressure of oxygen.
ht: Se konsa droit isit la, nou pa gen sou Des a ou kouche plat aks a, nou gen a pwesyon partielle de oksijèn.

source: And if you watched the chemistry lectures on partial pressure, you know that partial pressure just means, how frequently are you being bumped into by oxygen?
ht: Et si ou à conférences Chimi sou partiel bay/fè presyon, ou konnen sa pwesyon partielle jis, ou janm wè sont ou te a nan pa oksijèn?

source: Pressure is generated by gases or molecules bumping into you.
ht: Bay/fè presyon te pwodwi pa gaz ou molécules ainsi nan ou.

source: It doesn't have to be gas, but just molecules bumping into you.
ht: Li pa gen pou gaz, men se sèlman molécules ainsi nan ou.

source: And then the partial pressure of oxygen is the amount of that that's generated by oxygen molecules bumping into you.
ht: Et puis a pwesyon partielle de oksijèn se kantite Lè sa a, sa ki te pwodwi pa molécules oksijèn ainsi nan ou.

source: So you can imagine as you go to the right, there's just more and more oxygen around so you're going to get more and more bumped into by oxygen.
ht: Se konsa, ou ka konprann menm jan ou fè bò dwat, se sèlman pi plis oksijèn autour se konsa nou pwal gen plis Et plis a nan pa oksijèn.

source: So this is just essentially saying, how much oxygen is around as you go to the right axis?
ht: Se konsa sa sèlman esansyèlman dire, ki kantite oksijèn se apepwè jan ou ale a aks dwat?

source: And then the vertical axis tells you, how saturated are your hemoglobin molecules?
ht: Et puis aks vètikal a di ou, jan saturée sont molécules moglobin ou?

source: This 100% would mean all of the heme groups on all of the hemoglobin molecules or proteins have bound to oxygen.
ht: Sa a 100% ta vle di tout gwoup heme yo sou tout de la moglobin molécules ou protéines te limite pou oksijèn.

source: Zero means that none have.
ht: Zewo vle di ke aucun gen.

source: So when you have an environment with very little oxygen-- and this actually shows the cooperative binding-- so let's say we're just dealing with an environment with very little oxygen.
ht: Se konsa, lè ou gen yon anviwonman ak yon sèl oksijèn - Et sa a aktyèlman montre la gen pou kowopere Liaison - an se konsa nou di nou ap sèlman wè ak yon anviwònman ak ti fi oksijèn.

source: So once a little bit of oxygen binds, then it makes it even more likely that more and more oxygen will bind.
ht: Se konsa, yon fwa ke yon ti oksijèn se lè sa a li fè li menm plis ke sa pi plis oksijèn ap mare.

source: As soon as a little-- that's why the slope is increasing.
ht: Talè kòm yon ti - se poutèt sa ti mòn lan ap ogmante.

source: I don't want to go into algebra and calculus here, but as you see, we're kind of flattish, and then the slope increases.
ht: Mwen pa vle ale nan Aljèb Et kwout jòn isit la, men menm jan nou wè l ', nou gen ti jan de flattish, Et Lè sa a, ti mòn lan ogmante.
